### Pandas Advance -I , Assignment

#### Q1. List any five functions of the pandas library with execution.

Ans:
The list of the five functions of the pandas library with their execution is given below:

In [3]:
# 1: read_csv()

import pandas as pd
df = pd.read_csv('titanic.csv')

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [12]:
# 2: groupby():
#This function is used to group a Pandas DataFrame by one or more columns and apply a function to 
#each group. 

import pandas as pd

data = {
    'Name': ['Dilli', 'Sukrit', 'Sita', 'Kabita'],
    'Age': [28, 22, 25, 21],
    'Gender': ['Male', 'Male', 'Female', 'Female']
}

df = pd.DataFrame(data)

#using groupby:
grouped = df.groupby('Gender')
print(grouped.mean())

         Age
Gender
Female  23.0
Male    25.0

C:\Users\Dell\AppData\Local\Temp\ipykernel_6496\1214392851.py:17: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  print(grouped.mean())

In [13]:
# 3: fillna()
#fillna(): This function is used to fill missing values in a Pandas DataFrame with a specified
#value or method. Here's an example of how to use it:

import pandas as pd
import numpy as np


#create dataset
data = {'name': ['Mitthu', 'Chikku', np.nan, 'Bikram', 'Raghab'],
        'age': [25, 30, np.nan, 40, 45],
        'gender': ['M', 'F', 'M', 'F', 'M']}

df = pd.DataFrame(data)

df.fillna(value='Unknown', inplace=True)
print(df)

      name      age gender
0   Mitthu     25.0      M
1   Chikku     30.0      F
2  Unknown  Unknown      M
3   Bikram     40.0      F
4   Raghab     45.0      M

In [16]:
# 4:  pivot_table()
#This function is used to create a pivot table from a Pandas DataFrame, where the rows 
#represent one variable, the columns represent another variable, 
#and the values represent an aggregation of a third variable.

#example code:

import pandas as pd

data = {'name': ['Rishab', 'Radha', 'Bindu', 'Bishal', 'Chakra'],
        'age': [25, 23, 24, 21, 32],
        'gender': ['M', 'F', 'F', 'M', 'M'],
        'salary': [50000, 60000, 70000, 80000, 90000]}

df = pd.DataFrame(data)

pivot = df.pivot_table(values='salary', index='gender', columns='age', aggfunc='mean')
print(pivot)

age          21       23       24       25       32
gender
F           NaN  60000.0  70000.0      NaN      NaN
M       80000.0      NaN      NaN  50000.0  90000.0

In [18]:
# 5: merge()
# This function is used to merge two or more Pandas DataFrames based on a common column.

#code:
import pandas as pd

data1 = {'name': ['Rinku', 'Pinku', 'Sinku'],
         'age': [25, 30, 35],
         'gender': ['M', 'F', 'M']}

data2 = {'name':['Rinku','Pinku', 'Si nku', 'Jhinku', 'Tinku'],
'salary': [50000, 60000, 70000, 80000, 90000]}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

merged_result = pd.merge(df1, df2, on='name')

In [19]:
merged_result

    name  age gender  salary
0  Rinku   25      M   50000
1  Pinku   30      F   60000

#### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [29]:
import pandas as pd

def reindex_df(df):
    # Reset the index of the DataFrame to the default integer index
    df = df.reset_index()
    
    # Create a new index that starts from 1 and increments by 2 for each row
    new_index = pd.RangeIndex(start=1, stop=2*len(df), step=2)
    
    # Set the new index for the DataFrame
    df = df.set_index(new_index)
    
    return df

In [30]:
# Create a DataFrame
data = {'A': [1, 2, 3],
        'B': [4, 5, 6],
        'C': [7, 8, 9]}
df = pd.DataFrame(data)

# Print the original DataFrame
print(df)

# Re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row
new_df = reindex_df(df)

# Print the re-indexed DataFrame
print(new_df)

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9
   index  A  B  C
1      0  1  4  7
3      1  2  5  8
5      2  3  6  9

###### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
###### iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
###### function should print the sum to the console.
###### For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
###### calculate and print the sum of the first three values, which is 60.

In [33]:
#code:

import pandas as pd

df = pd.DataFrame({
    'Values': [10, 20, 30, 40, 50]
})

df

   Values
0      10
1      20
2      30
3      40
4      50

In [34]:
# python function to calculate the sum of first three values in the Values column
def sum_of_three_vlaues(df):
    first_three_values = df['Values'].iloc[:3]
    numbers_sum = sum(first_three_values)
    
    print('The sum of first three values is ', numbers_sum)


    
sum_of_three_vlaues(df)

The sum of first three values is  60

#### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [52]:
#code
import pandas as  pd
df = pd.DataFrame({
    'Text': ['Ram Kumar', 'Johny Gentleman', 'Ritesh Ram Chaudhary', 'Pwskills']
})

In [54]:
# before counting and creating another column named 'Word_Count'
df

                   Text
0             Ram Kumar
1       Johny Gentleman
2  Ritesh Ram Chaudhary
3              Pwskills

In [56]:
#python function to calculate word:
def add_word_count(df):
    # Use str.split() to split the 'Text' column into words
    words = df['Text'].str.split()
    # Use apply() and len() to count the number of words in each row
    word_counts = words.apply(len)
    # Add the 'Word_Count' column to the DataFrame
    df['Word_Count'] = word_counts
    
add_word_count(df)

In [58]:
#After counting words in the column 'Text' and creating an extra column 'Word_Count'
df

                   Text  Word_Count
0             Ram Kumar           2
1       Johny Gentleman           2
2  Ritesh Ram Chaudhary           3
3              Pwskills           1

##### Q5. How are DataFrame.size() and DataFrame.shape() different?

##### Ans:
- DataFrame.size() returns the total number of elements in the DataFrame, i.e., the product of the number of rows and the number of columns. It returns a single integer value.
- DataFrame.shape() returns a tuple containing the number of rows and columns in the DataFrame, respectively. It returns a tuple of two integers.

In [60]:
#Example code:
import pandas as pd

data = {'name': ['John', 'Jane', 'Bob'], 
        'age': [25, 30, 35], 
        'gender': ['M', 'F', 'M']}
df = pd.DataFrame(data)

print(df.size)    
print(df.shape)

9
(3, 3)

#### Q6. Which function of pandas do we use to read an excel file?

##### Ans:
To read an Excel file in Pandas, we use the read_excel() function.

In [63]:
# Example code:
import pandas as pd

# Read an Excel file into a DataFrame
df = pd.read_excel('example.xlsx')

# Print the first five rows of the DataFrame
print(df.head())

#### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [64]:
#### Code:
import pandas as pd

def extract_username(df):
    # Use the str.split() method to split the 'Email' column on the '@' symbol
    username_series = df['Email'].str.split('@', expand=True)[0]
    
    # Add a new column 'Username' to the DataFrame with the extracted username values
    df['Username'] = username_series
    
    return df

In [68]:
df = pd.DataFrame({'Email': ['chaudharydr@example.com', 'sukrityadav@example.com']})
df = extract_username(df)
print(df)

                     Email     Username
0  chaudharydr@example.com  chaudharydr
1  sukrityadav@example.com  sukrityadav

#### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [90]:
#code:
import pandas as pd
df = pd.DataFrame({
    'A': [4,5,6,7,89,32,2,4,9,5],
    'B': [1,9,66, 5, 8,44,21,2, 4, 11],
    'C': [2,3,4,5,8,66,44,3, 5,12]
})

def selected_rows(df):
    new_rows = df[(df['A'] > 5) & (df['B']<10)]
    return new_rows

In [91]:
selected_rows(df)

    A  B  C
3   7  5  5
4  89  8  8
8   9  4  5

#### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [81]:
import pandas as pd

def calc_stats(df):
    mean = df['Values'].mean()
    median = df['Values'].median()
    std_dev = df['Values'].std()
    return mean, median, std_dev
df = pd.DataFrame({'Values': [1, 2, 3, 4, 5]})
mean, median, std_dev = calc_stats(df)
print('Mean:', mean)
print('Median:', median)
print('Standard deviation:', std_dev)

Mean: 3.0
Median: 3.0
Standard deviation: 1.5811388300841898

#### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [86]:
import pandas as pd

def calculate_moving_average(df):
    # Set 'Date' column as the index
    df.set_index('Date', inplace=True)
    
    # Calculate the rolling mean with window size of 7
    ma = df.rolling(window=7).mean()
    
    # Rename 'Sales' column to 'MovingAverage'
    ma = ma.rename(columns={'Sales': 'MovingAverage'})
    
    # Reset the index
    ma.reset_index(inplace=True)
    
    return ma

df = pd.DataFrame({
    'Sales': [1000, 2000, 3000, 4000, 5000, 6000,7000],
    'Date': [2023-11-1, 2023-11-2, 2023-11-3, 2023-11-4, 2023-11-5, 2023-11-6, 2023-11-7]
})


calculate_moving_average(df)

   Date  MovingAverage
0  2011            NaN
1  2010            NaN
2  2009            NaN
3  2008            NaN
4  2007            NaN
5  2006            NaN
6  2005         4000.0

##### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [89]:
import pandas as pd

# create a sample dataframe
df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']})

# convert Date column to datetime dtype
df['Date'] = pd.to_datetime(df['Date'])

# use day_name() function to get weekday name of each date
df['Weekday'] = df['Date'].dt.day_name()

print(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

##### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [92]:
import pandas as pd

def select_rows_by_date(df):
    start_date = '2023-01-01'
    end_date = '2023-01-31'
    mask = (df['Date'] >= start_date) & (df['Date'] <= end_date)
    new_df = df.loc[mask]
    return new_df

In [95]:
# checking
df = pd.DataFrame({
    'Date': ['2022-01-01','2023-01-01', '2023-01-02', '2023-01-03', 
             '2023-01-04', '2023-01-05', '2023-01-06', '2024-01-23']
})

select_rows_by_date(df)

         Date
1  2023-01-01
2  2023-01-02
3  2023-01-03
4  2023-01-04
5  2023-01-05
6  2023-01-06

##### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

In [97]:
#To use the basic functions of pandas, the first and foremost necessary library that needs to be 
#imported is pandas itself. 

#Example code:
import pandas as pd

here, pd refers to the alias of pandas